<!DOCTYPE html><html lang="zh-CN"><head><meta name="generator" content="Hexo 3.8.0"><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>成为一个有目标的学习者 | itgoyo'blog</title><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/normalize/7.0.0/normalize.min.css"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/pure/1.0.0/pure-min.css"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/pure/1.0.0/grids-responsive-min.css"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.7.0/css/font-awesome.min.css"><script type="text/javascript" src="//cdn.bootcss.com/jquery/3.2.1/jquery.min.js"></script><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">成为一个有目标的学习者</h1><a id="logo" href="/.">itgoyo'blog</a><p class="description">Talk is cheap,Show me the girl.</p></div><div id="nav-menu"><a class="current" href="/."><i class="fa fa-home"> 主页</i></a><a href="/archives/"><i class="fa fa-archive"> 文章</i></a><a href="/history"><i class="fa fa-calendar"> 历史</i></a><a href="/books"><i class="fa fa-book"> 书籍</i></a><a href="/movies"><i class="fa fa-film"> 电影</i></a><a href="/games"><i class="fa fa-gamepad"> 游戏</i></a><a href="https://itgoyo.github.io/gallery.html"><i class="fa fa-photo"> 相册</i></a><a href="https://itgoyo.github.io/resume"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> RSS</i></a></div></div><div class="pure-g" id="layout"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">成为一个有目标的学习者</h1><div class="post-meta">Feb 15, 2019<script src="https://busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> 阅读</span></span><script async src="http://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script><ins class="adsbygoogle" style="display:inline-block;width:728px;height:90px" data-ad-client="ca-pub-5803807445434654" data-ad-slot="9146169046"></ins><script>(adsbygoogle = window.adsbygoogle || []).push({});</script></div><a class="disqus-comment-count" data-disqus-identifier="2019/02/15/成为一个有目标的学习者/" href="/2019/02/15/成为一个有目标的学习者/#disqus_thread"></a><a class="disqus-comment-count" href="/2019/02/15/成为一个有目标的学习者/#vcomment"><span class="valine-comment-count" data-xid="/2019/02/15/成为一个有目标的学习者/"></span><span>条评论</span></a><div class="post-content"><div class="enNote" style="" title="" lang="" xml:lang="" dir=""><div><br></div><div style="font-size: 16px; min-width: 100%; position: relative;"><div style="text-size-adjust: 100%; box-sizing: border-box; font-size: 10px; -webkit-tap-highlight-color: rgba(0, 0, 0, 0); overflow-x: hidden;"><div style="box-sizing: border-box; font-size: 16px; background-color: rgb(255, 255, 255); background-size: auto; overflow-x: hidden; -webkit-font-smoothing: antialiased; background-image: url(&quot;https://daimajia.com/wp-content/uploads/2018/05/funky-lines.png&quot;); background-position: left top; background-repeat: repeat; background-attachment: scroll;"><div style="box-sizing:border-box;background:rgb(255, 255, 255);"><div style="box-sizing:border-box;"><div style="box-sizing:border-box;"><div style="box-sizing:border-box;background:rgb(255, 255, 255);"><div style="box-sizing:border-box;-webkit-box-flex:1;"><div style="box-sizing: border-box; border-bottom: none; padding: 80px 90px; position: relative;"><div style="box-sizing: border-box;"><h1 style="font-size: 48px; margin: 0px 0px 13px; box-sizing: border-box; text-align: center;"><span style="font-size: 48px; font-family: &quot;Roboto Slab&quot;; color: rgb(85, 85, 85); line-height: 1.2; font-weight: 300;">&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x6709;&#x76EE;&#x6807;&#x7684;&#x5B66;&#x4E60;&#x8005;</span></h1><div style="box-sizing: border-box; text-align: center; font-size: 12px; text-transform: uppercase; letter-spacing: 1px;"><span style="box-sizing:border-box;"><a href="https://daimajia.com/2017/02/25/you-need-a-goal" rel="noopener" style="background-color: transparent; box-sizing: border-box; outline: none;" target="_blank"><a href="https://daimajia.com/2017/02/25/you-need-a-goal" style="font-size: 12px; font-family: &quot;Roboto Condensed&quot;; line-height: 1.625; background-color: transparent; color: rgb(54, 153, 220); text-decoration: none; box-sizing: border-box;" target="_blank" rel="noopener">2017&#x5E74;2&#x6708;25&#x65E5;</a></a></span> <span style="font-size: 12px; font-family: &quot;Roboto Condensed&quot;; color: rgb(119, 119, 119); line-height: 1.625;">by</span> <span style="box-sizing:border-box;"><a href="https://daimajia.com/author/daimajia" rel="noopener" style="background-color: transparent; box-sizing: border-box; outline: none;" target="_blank"><a href="https://daimajia.com/author/daimajia" style="font-size: 12px; font-family: &quot;Roboto Condensed&quot;; line-height: 1.625; background-color: transparent; color: rgb(54, 153, 220); text-decoration: none; box-sizing: border-box;" target="_blank" rel="noopener">daimajia</a></a></span><span style="box-sizing: border-box; margin: 0px 10px; font-size: 12px; font-family: &quot;Roboto Condensed&quot;; color: rgb(119, 119, 119); line-height: 1.625;">&#xB7;</span><span style="box-sizing:border-box;"><a href="https://daimajia.com/2017/02/25/you-need-a-goal#comments" style="background-color: transparent; box-sizing: border-box; outline: none; font-size: 12px; font-family: &quot;Roboto Condensed&quot;; line-height: 1.625; color: rgb(54, 153, 220); text-decoration: none;" target="_blank" rel="noopener">21&#x6761;&#x8BC4;&#x8BBA;</a></span></div></div><div style="box-sizing:border-box;padding:30px 0px 0px;"><div style="box-sizing: border-box; margin: 0px 0px 13px;"><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#x6211;&#x4E00;&#x4E2A;&#x597D;&#x670B;&#x53CB;&#xFF0C;&#x4ED6;&#x5728;&#x4E00;&#x5BB6;&#x56FD;&#x5185;&#x8F83;&#x5927;&#x501F;&#x8D37;&#x5E73;&#x53F0;&#x505A;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x6BCF;&#x5929;&#x4E94;&#x70B9;&#x8D77;&#x5E8A;&#xFF0C;&#x65E9;&#x65E9;&#x7684;&#x5230;&#x516C;&#x53F8;&#xFF0C;&#x5F00;&#x59CB;&#x8BFB;&#x4E00;&#x4E9B;&#x7ECF;&#x5178;&#x7684;&#x524D;&#x7AEF;&#x7C7B;&#x7684;&#x4E66;&#x7C4D;&#x3002;&#x8D77;&#x7684;&#x8FD9;&#x4E48;&#x65E9;&#x7684;&#x52A8;&#x529B;&#x662F;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x8FD8;&#x6CA1;&#x80FD;&#x591F;&#x638C;&#x63E1;&#x524D;&#x7AEF;&#x7684;&#x5F88;&#x591A;&#x7EC6;&#x8282;&#xFF0C;&#x771F;&#x6B63;&#x5728;&#x505A;&#x5F00;&#x53D1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F9D;&#x7136;&#x4F1A;&#x5FD8;&#x8BB0;&#x4E4B;&#x524D;&#x770B;&#x5230;&#x8FC7;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x603B;&#x662F;&#x4E0B;&#x610F;&#x8BC6;&#x7684;&#x544A;&#x8BC9;&#x81EA;&#x5DF1;&#xFF1A;&#x300E;&#x53EF;&#x80FD;&#x6211;&#x8FD8;&#x5904;&#x5728;&#x5165;&#x95E8;&#x6C34;&#x5E73;&#x300F;&#x3002;</span></div><div style="box-sizing: border-box; margin: 0px 0px 13px;"><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#x957F;&#x6B64;&#x4EE5;&#x5F80;&#xFF0C;&#x8D77;&#x7684;&#x8D8A;&#x6765;&#x8D8A;&#x65E9;&#xFF0C;&#x4E2D;&#x5348;&#x540C;&#x4E8B;&#x4F11;&#x606F;&#x8054;&#x673A;&#x73A9;&#x513F;&#x624B;&#x6E38;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x4E0D;&#x653E;&#x8FC7;&#x65F6;&#x95F4;&#x53BB;&#x770B;&#x4E66;&#xFF0C;&#x538B;&#x529B;&#x4E5F;&#x968F;&#x4E4B;&#x53D8;&#x5927;&#x3002;&#x5F00;&#x59CB;&#x5426;&#x8BA4;&#x81EA;&#x5DF1;&#x5728;&#x8F6C;&#x884C;&#x524D;&#x7AEF;&#x4E4B;&#x524D;&#x7684;&#x65F6;&#x5149;&#xFF0C;&#x611F;&#x89C9;&#x90FD;&#x88AB;&#x6D6A;&#x8D39;&#x6389;&#x4E86;&#x4F3C;&#x7684;&#xFF0C;&#x8D8A;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x8D8A;&#x662F;&#x65E0;&#x6CD5;&#x6323;&#x8131;&#xFF0C;&#x9010;&#x6B65;&#x7684;&#x8D70;&#x5230;&#x6B7B;&#x80E1;&#x540C;&#x4E2D;&#xFF0C;&#x5F77;&#x5FA8;&#xFF0C;&#x75DB;&#x82E6;&#x3002;</span></div><div style="box-sizing: border-box; margin: 0px 0px 13px;"><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#x4ED6;&#x5F88;&#x75DB;&#x82E6;&#xFF0C;&#x5E0C;&#x671B;&#x6211;&#x80FD;&#x63D0;&#x4E9B;&#x81EA;&#x5DF1;&#x7684;&#x770B;&#x6CD5;&#x3002;</span></div><div style="box-sizing: border-box; margin: 0px 0px 13px;"><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#x6211;&#x60F3;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x66FE;&#x6709;&#x8FC7;&#x8FD9;&#x79CD;&#x65F6;&#x5149;&#x3002;&#x5C31;&#x597D;&#x6BD4;&#x9AD8;&#x8003;&#x524D;&#x7684;&#x5404;&#x79CD;&#x6A21;&#x62DF;&#x8BD5;&#x9898;&#x4E00;&#x6837;&#xFF0C;&#x603B;&#x6709;&#x4E00;&#x79CD;&#x4EBA;&#xFF0C;&#x559C;&#x6B22;&#x5728;&#x505A;&#x6A21;&#x62DF;&#x8BD5;&#x9898;&#x524D;&#xFF0C;&#x628A;&#x6574;&#x672C;&#x4E66;&#x90FD;&#x5148;&#x8FC7;&#x4E00;&#x904D;&#x3002;&#x8FD9;&#x6837;&#x771F;&#x7684;&#x6709;&#x610F;&#x4E49;&#x5417;&#xFF1F;&#x6211;&#x8BA4;&#x4E3A;&#x56DE;&#x62A5;&#x662F;&#x5F88;&#x5C0F;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x4F60;&#x5B9A;&#x4E86;&#x4E00;&#x4E2A;&#x6709;&#x4E9B;&#x8FC2;&#x56DE;&#x548C;&#x9003;&#x907F;&#x6027;&#x8D28;&#x7684;&#x76EE;&#x6807;&#x3002;&#x5F53;&#x5165;&#x95E8;&#x9636;&#x6BB5;&#x5DF2;&#x7ECF;&#x8D70;&#x8FC7;&#x4EE5;&#x540E;&#xFF0C;&#x4F60;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x518D;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4F1A;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x3001;&#x6D88;&#x8017;&#x4F53;&#x529B;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x53EA;&#x4F1A;&#x8BA9;&#x4F60;&#x4E27;&#x5931;&#x5B66;&#x4E60;&#x7684;&#x52A8;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x4E0D;&#x518D;&#x4F1A;&#x6709;&#x6BD4;&#x7B2C;&#x4E00;&#x6B21;&#x5B66;&#x4F1A;&#x66F4;&#x5F3A;&#x7684;&#x6B63;&#x5411;&#x53CD;&#x9988;&#x4E86;&#xFF0C;&#x5F53;&#x4F60;&#x8017;&#x8D39;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x548C;&#x4F53;&#x529B;&#x8FC7;&#x4E86;&#x4E00;&#x904D;&#x4EE5;&#x540E;&#xFF0C;&#x4F9D;&#x7136;&#x65E0;&#x6240;&#x5F97;&#xFF0C;&#x8FD9;&#x662F;&#x591A;&#x4E48;&#x4EE4;&#x4EBA;&#x632B;&#x8D25;&#x7684;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x554A;&#x3002;</span></div><div style="box-sizing: border-box; margin: 0px 0px 13px;"><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#x90A3;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF0C;&#x4E00;&#x65E6;&#x5165;&#x95E8;&#x540E;&#xFF0C;&#x5982;&#x4F55;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x66F4;&#x6709;&#x6FC0;&#x52B1;&#x6027;&#x8D28;&#x7684;&#x6B63;&#x53CD;&#x9988;&#x5462;&#xFF1F;</span></div><div style="box-sizing: border-box; margin: 0px 0px 13px;"><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#x4F9D;&#x7136;&#x662F;&#x5B9A;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x5B9A;&#x4E00;&#x4E2A;&#x4F60;&#x4ECE;&#x672A;&#x5C1D;&#x8BD5;&#x6216;&#x8FBE;&#x5230;&#x8FC7;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x8BA9;&#x65B0;&#x7684;&#x76EE;&#x6807;&#x53BB;&#x523A;&#x6FC0;&#x4F60;&#x7684;&#x591A;&#x5DF4;&#x80FA;&#x548C;&#x80BE;&#x4E0A;&#x817A;&#x7D20;&#xFF0C;&#x8BA9;&#x4F60;&#x5BF9;&#x67D0;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#x3001;&#x6280;&#x672F;&#x4EA7;&#x751F;&#x6301;&#x7EED;&#x7684;&#x4EA2;&#x594B;&#xFF0C;&#x4ECE;&#x800C;&#x65E0;&#x5F62;&#x4E2D;&#x6210;&#x4E3A;&#x7EC8;&#x751F;&#x5B66;&#x4E60;&#x8005;&#x3002;</span></div><div style="box-sizing: border-box; margin: 0px 0px 13px;"><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#x5BF9;&#x4E8E;&#x6280;&#x672F;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x65B0;&#x7684;&#x76EE;&#x6807;&#x53EF;&#x4EE5;&#x662F;&#x505A;&#x4E00;&#x4E2A;&#x89E3;&#x51B3;&#x81EA;&#x5DF1;&#x751F;&#x6D3B;&#x4E2D;&#x9047;&#x5230;&#x95EE;&#x9898;&#x7684;&#x5C0F;&#x4EA7;&#x54C1;&#xFF0C;&#x52AA;&#x529B;&#x505A;&#x5230; 1000 &#x65E5;&#x6D3B;&#xFF0C;&#x505A;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#xFF0C;&#x52AA;&#x529B;&#x5F97;&#x5230; 1000 &#x4E2A; Star&#xFF0C;&#x505A;&#x4E00;&#x4E2A;&#x5C0F;&#x5DE5;&#x5177;&#xFF0C;&#x52AA;&#x529B;&#x8D5A;&#x5230; 1000 &#x4EBA;&#x6C11;&#x5E01;&#xFF0C;&#x505A;&#x4E00;&#x4E2A;&#x5C0F;&#x793E;&#x7FA4;&#xFF0C;&#x52AA;&#x529B;&#x62E5;&#x6709; 1000 &#x4E2A;&#x6CE8;&#x518C;&#x7528;&#x6237;&#xFF0C;&#x6216;&#x8005;&#x5F00;&#x4E00;&#x7BC7;&#x535A;&#x5BA2;&#xFF0C;&#x5199;&#x4E00;&#x4E2A;&#x516C;&#x4F17;&#x53F7;&#xFF0C;&#x52AA;&#x529B;&#x505A;&#x5230; 1000 &#x9605;&#x8BFB;&#x3002;</span></div><div style="box-sizing: border-box; margin: 0px 0px 13px;"><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x6210;&#x4E3A;&#x523A;&#x6FC0;&#x4F60;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x6E90;&#x6CC9;&#x3002;&#x5F88;&#x591A;&#x5F88;&#x80FD;&#x6298;&#x817E;&#x7684;&#x4EBA;&#xFF0C;&#x603B;&#x662F;&#x5728;&#x6301;&#x7EED;&#x4E0D;&#x65AD;&#x7684;&#x6298;&#x817E;&#xFF0C;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x603B;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x63A5;&#x6536;&#x6B63;&#x53CD;&#x9988;&#xFF0C;&#x4ED6;&#x4EEC;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x8BA4;&#x53EF;&#x81EA;&#x5DF1;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x3002;</span></div><div style="box-sizing: border-box; margin: 0px 0px 13px;"><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#x4E0D;&#x8981;&#x56E0;&#x4E3A;&#x522B;&#x4EBA;&#x8BF4;&#x4E00;&#x672C;&#x4E66;&#x597D;&#xFF0C;&#x6216;&#x662F;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x4E00;&#x7C7B;&#x6280;&#x672F;&#x597D;&#xFF0C;&#x5C31;&#x53BB;&#x5B66;&#x5B83;&#xFF0C;&#x5176;&#x5B9E;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x5B66;&#x5B83;&#x7684;&#x52A8;&#x529B;&#x5176;&#x5B9E;&#x662F;</span><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625; font-weight: bold; box-sizing: border-box;">&#x4F2A;&#x52A8;&#x529B;</span><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#xFF0C;</span><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625; font-weight: bold; box-sizing: border-box;">&#x5B66;&#x6709;&#x6240;&#x7528;</span><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#x624D;&#x662F;&#x53EF;&#x80FD;&#x6301;&#x7EED;&#x5B66;&#x4E60;&#x7684;&#x52A8;&#x529B;&#xFF0C;&#x4E3B;&#x89C2;&#x7684;&#x575A;&#x6301;&#x4E0D;&#x662F;&#x53EF;&#x6301;&#x7EED;&#x7684;&#x771F;&#x6B63;&#x52A8;&#x529B;&#x3002;</span></div><div style="box-sizing: border-box; margin: 0px 0px 13px;"><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#x6211;&#x5176;&#x5B9E;&#x4E00;&#x76F4;&#x662F;&#x5F88;&#x4E0D;&#x4E3B;&#x5F20;&#x53BB;&#x8BFB;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x6280;&#x672F;&#x6587;&#x7AE0;&#xFF0C;&#x81F3;&#x5C11;&#x5927;&#x591A;&#x6570;&#x6280;&#x672F;&#x6587;&#x7AE0;&#x90FD;&#x662F;&#x5BF9;&#x4F60;&#x65E0;&#x76CA;&#x7684;&#xFF0C;&#x8BFB;&#x7684;&#x8D8A;&#x591A;&#xFF0C;&#x4F60;&#x8D8A;&#x662F;&#x4F1A;&#x4EA7;&#x751F;&#x5F77;&#x5FA8;&#x548C;&#x7126;&#x8651;&#xFF0C;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x6CA1;&#x6709;&#x6210;&#x957F;&#xFF0C;&#x7F3A;&#x5C11;&#x81EA;&#x4FE1;&#x3002;&#x7F3A;&#x5C11;&#x81EA;&#x4FE1;&#x7684;&#x8868;&#x73B0;&#x662F;&#x4F60;&#x4F1A;&#x6050;&#x60E7;&#x672A;&#x6765;&#x9047;&#x5230;&#x7684;&#x65B0;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x8FD8;&#x662F;&#x5F97;&#x5927;&#x91CF;&#x4F9D;&#x8D56;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x53BB;&#x8BFB;&#x51E0;&#x767E;&#x7BC7;&#x535A;&#x5BA2;&#x53BB;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x6CA1;&#x6709;&#x81EA;&#x5DF1;&#x771F;&#x6B63;&#x7684;&#x72EC;&#x7ACB;&#x601D;&#x8003;&#xFF0C;&#x4F60;&#x53EA;&#x89E3;&#x51B3;&#x4E86;&#x4E00;&#x4E2A;&#x773C;&#x524D;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x5957;&#x7528;&#x5230;&#x5343;&#x5343;&#x4E07;&#x4E07;&#x4E2A;&#x95EE;&#x9898;&#x4E0A;&#xFF0C;&#x4F60;&#x65E0;&#x6CD5;&#x4EA2;&#x594B;&#x81EA;&#x5DF1;&#x7684;&#x795E;&#x7ECF;&#xFF0C;&#x800C;&#x4EA7;&#x751F;&#x6301;&#x7EED;&#x7684;&#x5B66;&#x4E60;&#x548C;&#x7814;&#x7A76;&#x6B32;&#x671B;&#x3002;</span></div><div style="box-sizing: border-box; margin: 0px 0px 13px;"><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#x5927;&#x91CF;&#x8BFB;&#x522B;&#x4EBA;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x5176;&#x5B9E;&#x4F60;&#x4E5F;&#x65E0;&#x6CD5;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#x8BBA;&#xFF0C;&#x4F60;&#x4F1A;&#x6ECB;&#x751F;&#x601D;&#x60F3;&#x7684;&#x61D2;&#x60F0;&#xFF0C;&#x5F88;&#x591A;&#x7F8E;&#x597D;&#x7684;&#x4E8B;&#x7269;&#x548C;&#x673A;&#x4F1A;&#xFF0C;&#x4E5F;&#x4F1A;&#x548C;&#x4F60;&#x64E6;&#x8EAB;&#x800C;&#x8FC7;&#x3002;</span></div><div style="box-sizing: border-box; margin: 0px 0px 13px;"><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#x6709;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8BFB;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x6280;&#x672F;&#x6587;&#x7AE0;&#x4E5F;&#x4F1A;&#x8BA9;&#x81EA;&#x5DF1;&#x4EA7;&#x751F;&#x4E00;&#x79CD;&#x8BE1;&#x5F02;&#x7684;&#x6EE1;&#x8DB3;&#x611F;&#xFF0C;&#x4F60;&#x4F1A;&#x611F;&#x5230;&#x6211;&#x8C8C;&#x4F3C;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x90FD;&#x4F1A;&#xFF0C;&#x53EA;&#x662F;&#x6709;&#x4E9B;&#x4E0D;&#x719F;&#x7F62;&#x4E86;&#xFF0C;&#x771F;&#x7684;&#x5982;&#x6B64;&#x5417;&#xFF1F;</span></div><div style="box-sizing: border-box; margin: 0px 0px 13px;"><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#x4E3E;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x5F53;&#x521D;&#x5728;&#x51C6;&#x5907;&#x7092;&#x80A1;&#x7968;&#x524D;&#xFF0C;&#x5728;&#x96EA;&#x7403;&#x4E0A;&#x8BFB;&#x4E86;&#x5F88;&#x591A;&#x6587;&#x7AE0;&#xFF0C;&#x8FD8;&#x4E13;&#x95E8;&#x628A;&#x725B;&#x4EBA;&#x4EEC;&#x5206;&#x6210;&#x4E86;&#x4E00;&#x7EC4;&#xFF0C;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;&#xFF0C;&#x968F;&#x5373;&#x5F00;&#x6237;&#x7838;&#x94B1;&#x8FDB;&#x53BB;&#xFF0C;&#x4F46;&#x76F4;&#x5230;&#x771F;&#x6B63;&#x5F00;&#x59CB;&#x64CD;&#x76D8;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x79CD;&#x6211;&#x5DF2;&#x7ECF;&#x5B66;&#x4F1A;&#x4E86;&#x7684;&#x9519;&#x89C9;&#xFF0C;&#x8BA9;&#x6211;&#x8D54;&#x4E86;&#x4E0D;&#x5C11;&#x3002;&#x6709;&#x65F6;&#x5019;&#x5C31;&#x8DDF;&#x4F60;&#x770B;&#x4E86;&#x4E00;&#x767E;&#x7BC7;&#x67D0;&#x4E2A;&#x6280;&#x672F;&#x70B9;&#x7684;&#x6280;&#x672F;&#x6587;&#x7AE0;&#xFF0C;&#x771F;&#x7684;&#x5F00;&#x59CB;&#x5199;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4EC0;&#x4E48;&#x4E5F;&#x60F3;&#x4E0D;&#x8D77;&#x6765;&#xFF0C;&#x53C8;&#x5F97;&#x6253;&#x5F00;&#x4E00;&#x7BC7;&#xFF0C;&#x7167;&#x732B;&#x753B;&#x864E;&#x505A;&#x5B8C;&#xFF0C;&#x5374;&#x53D1;&#x73B0;&#x5D29;&#x6E83;&#x4E86;&#x3002;WTF&#x3002;&#x5176;&#x5B9E;&#x4F60;&#x5E76;&#x6CA1;&#x6709;&#x5B66;&#x4F1A;&#x3002;</span></div><div style="box-sizing: border-box; margin: 0px 0px 13px;"><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625; font-weight: bold; box-sizing: border-box;">&#x6211;&#x4E3B;&#x5F20;&#x4F60;&#x53BB;&#x770B;&#x539F;&#x59CB;&#x7684;&#x8D44;&#x6599;&#xFF0C;&#x4E3B;&#x5F20;&#x4F60;&#x53BB;&#x8BFB;&#x7CFB;&#x7EDF;&#x7684;&#x4E66;&#x7C4D;&#xFF0C;&#x4E3B;&#x5F20;&#x4F60;&#x53BB;&#x7814;&#x7A76;&#x5B98;&#x65B9;&#x6216;&#x662F;&#x4F18;&#x79C0;&#x9879;&#x76EE;&#x7684;&#x6E90;&#x7801;&#x3002;</span><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x4E00;&#x624B;&#x8D44;&#x6599;&#x548C;&#x4F18;&#x8D28; Demo&#x3002;&#x8FD9;&#x624D;&#x662F;&#x771F;&#x6B63;&#x7684;&#x65B9;&#x6CD5;&#x8BBA;&#xFF0C;</span><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625; font-weight: bold; box-sizing: border-box;">Google &#x662F;&#x4E0D;&#x4F1A;&#x7ED9;&#x4F60;&#x5E26;&#x6765;&#x5B89;&#x5168;&#x611F;&#x7684;</span><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#x3002;</span></div><div style="box-sizing: border-box; margin: 0px 0px 13px;"><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#x800C;&#x4E14;&#x5F88;&#x591A;&#x590D;&#x6742;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5176;&#x5B9E;&#x5F88;&#x96BE;&#x7528;&#x4E00;&#x7BC7;&#x535A;&#x5BA2;&#x6587;&#x7AE0;&#x5199;&#x6E05;&#x695A;&#x3002;&#x8D8A;&#x662F;&#x6E05;&#x695A;&#x5176;&#x4E2D;&#x903B;&#x8F91;&#x548C;&#x539F;&#x7406;&#x7684;&#x4EBA;&#xFF0C;&#x53CD;&#x800C;&#x8D8A;&#x662F;&#x5F88;&#x5C11;&#x5199;&#x6280;&#x672F;&#x6587;&#x7AE0;&#xFF0C;&#x4E00;&#x6765;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x4EBA;&#x611F;&#x89C9;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x8981;&#x7814;&#x7A76;&#xFF0C;&#x590D;&#x6742;&#x95EE;&#x9898;&#x5199;&#x8D77;&#x6765;&#x603B;&#x662F;&#x957F;&#x7BC7;&#x5927;&#x8BBA;&#xFF0C;&#x4F9D;&#x8D56;&#x77E5;&#x8BC6;&#x4E5F;&#x975E;&#x5E38;&#x591A;&#xFF0C;&#x5199;&#x8D77;&#x6765;&#x9EBB;&#x70E6;&#x3002;&#x4E8C;&#x6765;&#xFF0C;&#x7814;&#x7A76;&#x5230;&#x8FD9;&#x4E9B;&#x590D;&#x6742;&#x4E1C;&#x897F;&#x7684;&#x4EBA;&#xFF0C;&#x5F80;&#x5F80;&#x5DF2;&#x7ECF;&#x638C;&#x63E1;&#x4E86;&#x65B9;&#x6CD5;&#x8BBA;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x8BFB;&#x8FD9;&#x4E9B;&#x6587;&#x7AE0;&#xFF0C;&#x975E;&#x8981;&#x5199;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x8BDD;&#xFF0C;&#x53EA;&#x7528;&#x53EA;&#x8A00;&#x7247;&#x8BED;&#x63D0;&#x53CA;&#x601D;&#x8DEF;&#xFF0C;&#x4FBF;&#x591F;&#x4E86;&#x3002;</span></div><div style="box-sizing: border-box; margin: 0px 0px 13px;"><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#x5982;&#x679C;&#x4F60;&#x5728;&#x5165;&#x95E8;&#x9636;&#x6BB5;&#xFF0C;&#x4F60;&#x8BFB;&#x4EC0;&#x4E48;&#x90FD;&#x53EF;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x6709;&#x4E9B;&#x7A81;&#x7834;&#xFF0C;&#x5C31;&#x6309;&#x4E0A;&#x9762;&#x4E09;&#x6761;&#x65B9;&#x6CD5;&#x6765;&#x5427;&#xFF0C;&#x4E00;&#x5B9A;&#x8BA9;&#x4F60;&#x6709;&#x6240;&#x6536;&#x83B7;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x6709;&#x66F4;&#x5927;&#x7684;&#x7A81;&#x7834;&#xFF0C;&#x90A3;&#x5C31;&#x5148;&#x7ED9;&#x81EA;&#x5DF1;&#x5B9A;&#x4E2A;&#x4ECE;&#x672A;&#x8FBE;&#x5230;&#x8FC7;&#x7684;&#x76EE;&#x6807;&#x3002;</span></div><div style="box-sizing: border-box; margin: 0px 0px 13px;"><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#x6700;&#x540E;&#xFF0C;&#x82B1;&#x4E9B;&#x65F6;&#x95F4;&#x5A31;&#x4E50;&#xFF0C;&#x4E0D;&#x8981;&#x603B;&#x662F;&#x90A3;&#x4E48;&#x7D27;&#x5F20;&#xFF0C;&#x751F;&#x6D3B;&#x4E5F;&#x662F;&#x5F88;&#x5927;&#x7684;&#x4E00;&#x95E8;&#x5B66;&#x95EE;&#x3002;</span></div><div style="box-sizing: border-box; margin: 0px 0px 13px;"><span style="font-size: 16px; font-family: Roboto; color: rgb(85, 85, 85); line-height: 1.625;">&#x6B63;&#x5982; &#x6587;&#x660E;VI &#x4E2D;&#x63D0;&#x5230;&#x7684;&#x4E00;&#x53E5;&#x540D;&#x8A00;&#xFF1A;</span></div><blockquote style="box-sizing: border-box; padding: 0px 20px; margin: 0px 0px 26px; font-size: 16px; border-left: 5px solid rgb(238, 238, 238);"><div style="box-sizing: border-box; margin: 0px; font-size: small;"><span style="font-size: small; font-family: Roboto; color: rgb(119, 119, 119); line-height: 2;">&#x90A3;&#x4E9B;&#x6CA1;&#x65F6;&#x95F4;&#x5A31;&#x4E50;&#x7684;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x65F6;&#x95F4;&#x4F1A;&#x82B1;&#x5728;&#x751F;&#x75C5;&#x4E0A;&#x3002;&#x2014;&#x2014;&#x7EA6;&#x7FF0; &#x6C83;&#x7EB3;&#x6885;&#x514B;</span></div></blockquote></div></div></div></div></div></div></div></div></div></div><div>&#x539F;&#x6587;&#x51FA;&#x5904;&#xFF1A;<a href="https://daimajia.com/2017/02/25/you-need-a-goal" target="_blank" rel="noopener">https://daimajia.com/2017/02/25/you-need-a-goal</a></div></div></div><iframe src="/donate/?AliPayQR=/img/alipay.jpg&amp;WeChatQR=/img/wechat.jpg&amp;GitHub=null&amp;BTCQR=null&amp;BTCKEY=null&amp;PayPal=null" style="overflow-x:hidden; overflow-y:hidden; border:0xp none #fff; min-height:300px; width:100%;" frameborder="0" scrolling="no"></iframe><div class="tags"></div><div class="post-nav"><a class="pre" href="/2019/02/18/一个前端的2018总结，2019展望/">一个前端的2018总结，2019展望</a><a class="next" href="/2019/01/28/ieaseMusic-一款炫酷的网易云第三方客户端/">ieaseMusic-一款炫酷的网易云第三方客户端</a></div><div id="disqus_thread"><div class="btn_click_load"><button class="disqus_click_btn">阅读评论 「请确保 disqus.com 可以正常加载」</button></div><script>var disqus_shortname = 'itgoyo';
var disqus_identifier = '2019/02/15/成为一个有目标的学习者/';
var disqus_title = '成为一个有目标的学习者';
var disqus_url = 'https://github.com/itgoyo/2019/02/15/成为一个有目标的学习者/';
$('.btn_click_load').click(function() {
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
  $('.btn_click_load').css('display','none');
});
$.ajax({
  url: 'https://disqus.com/next/config.json',
  timeout: 3000,
  type: 'GET',
  success: (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    $('.btn_click_load').css('display','none');
  })(),
  error: function() {
    $('.btn_click_load').css('display','block');
  }
});</script><script id="dsq-count-scr" src="//itgoyo.disqus.com/count.js" async></script></div><div id="vcomment"></div><script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script><script src="//unpkg.com/valine@latest/dist/Valine.min.js"></script><script>var notify = 'true' == true ? true : false;
var verify = 'false' == true ? true : false;
var GUEST_INFO = ['nick','mail','link'];
var guest_info = 'nick,mail,link'.split(',').filter(function(item){
  return GUEST_INFO.indexOf(item) > -1
});
guest_info = guest_info.length == 0 ? GUEST_INFO :guest_info;
window.valine = new Valine({
  el:'#vcomment',
  notify:notify,
  verify:verify,
  appId:'HzQ14MvDJNcJ4Y73LGzWkuKD-gzGzoHsz',
  appKey:'gPggWGa1wwwhXbzuhnSQyQDx',
  placeholder:'Just so so',
  avatar:'mm',
  guest_info:guest_info,
  pageSize:'10'
})</script></div></div></div><div class="pure-u-1-4 hidden_mid_and_down"><div id="sidebar"><div class="widget"><div class="search-form"><input id="local-search-input" placeholder="Search" type="text" name="q" results="0"><div id="local-search-result"></div></div></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/Android/">Android</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Go/">Go</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Linux/">Linux</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Mac/">Mac</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Python/">Python</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Vim/">Vim</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/开发工具/">开发工具</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/开源项目/">开源项目</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/生活随笔/">生活随笔</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程相关/">编程相关</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/读书笔记/">读书笔记</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/Android/" style="font-size: 15px;">Android</a> <a href="/tags/Program/" style="font-size: 15px;">Program</a> <a href="/tags/Mac/" style="font-size: 15px;">Mac</a> <a href="/tags/生活随笔/" style="font-size: 15px;">生活随笔</a> <a href="/tags/Github/" style="font-size: 15px;">Github</a> <a href="/tags/Go/" style="font-size: 15px;">Go</a> <a href="/tags/Linux/" style="font-size: 15px;">Linux</a> <a href="/tags/Python/" style="font-size: 15px;">Python</a> <a href="/tags/Vim/" style="font-size: 15px;">Vim</a> <a href="/tags/插件/" style="font-size: 15px;">插件</a> <a href="/tags/Shadowsocks/" style="font-size: 15px;">Shadowsocks</a> <a href="/tags/科学上网/" style="font-size: 15px;">科学上网</a> <a href="/tags/读书笔记/" style="font-size: 15px;">读书笔记</a> <a href="/tags/Markdown/" style="font-size: 15px;">Markdown</a> <a href="/tags/记忆力/" style="font-size: 15px;">记忆力</a> <a href="/tags/python/" style="font-size: 15px;">python</a> <a href="/tags/shell/" style="font-size: 15px;">shell</a> <a href="/tags/读书/" style="font-size: 15px;">读书</a> <a href="/tags/Hexo/" style="font-size: 15px;">Hexo</a> <a href="/tags/i3/" style="font-size: 15px;">i3</a> <a href="/tags/Rofi/" style="font-size: 15px;">Rofi</a> <a href="/tags/ncmpcpp/" style="font-size: 15px;">ncmpcpp</a> <a href="/tags/Music/" style="font-size: 15px;">Music</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最近文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2020/11/29/2019一整年的总结与一些个人反思/">2019一整年的总结与一些个人反思</a></li><li class="post-list-item"><a class="post-list-link" href="/2019/12/03/Go语言数据类型/">Go语言数据类型</a></li><li class="post-list-item"><a class="post-list-link" href="/2019/12/03/Go基础语法/">Go基础语法</a></li><li class="post-list-item"><a class="post-list-link" href="/2019/12/02/Go简单入门/">Go简单入门</a></li><li class="post-list-item"><a class="post-list-link" href="/2019/11/29/没有音频输出的解决方式/">没有音频输出的解决方式</a></li><li class="post-list-item"><a class="post-list-link" href="/2019/11/25/Linux下面OBS支持Nvenc了/">Linux下面OBS支持Nvenc了</a></li><li class="post-list-item"><a class="post-list-link" href="/2019/10/30/驱动出现的黑屏各种问题和解决方式/">驱动出现的黑屏各种问题和解决方式</a></li><li class="post-list-item"><a class="post-list-link" href="/2019/09/27/Python列表和元组的详细区别/">Python列表和元组的详细区别</a></li><li class="post-list-item"><a class="post-list-link" href="/2019/09/26/Python基础一/">Python基础一</a></li><li class="post-list-item"><a class="post-list-link" href="/2019/09/25/我个人Mac常用的软件推荐/">我个人Mac常用的软件推荐</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-comment-o"> 最近评论</i></div><script type="text/javascript" src="//itgoyo.disqus.com/recent_comments_widget.js?num_items=5&amp;hide_avatars=1&amp;avatar_size=32&amp;excerpt_length=20&amp;hide_mods=1"></script></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="https://github.com/itgoyo" title="Github" target="_blank">Github</a><ul></ul><a href="https://space.bilibili.com/12767066/#/" title="BiliBili" target="_blank">BiliBili</a><ul></ul><a href="https://www.zhihu.com/people/mkosto/activities" title="ZhiHu" target="_blank">ZhiHu</a></div></div></div><div class="pure-u-1 pure-u-md-3-4"><p align="center">
<script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>
<span id="busuanzi_container_site_pv">本站总访问量<span id="busuanzi_value_site_pv"></span>次</span>
</p><div id="footer">Copyright © 2019 <a href="/." rel="nofollow">itgoyo'blog.</a> 作者Github:<a rel="nofollow" target="_blank" href="https://github.com/itgoyo"> itgoyo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/itgoyo"> Cho.</a></div></div></div><a class="show" id="rocket" href="#top"></a><script type="text/javascript" src="/js/totop.js?v=0.0.0" async></script><script type="text/javascript" src="//cdn.bootcss.com/fancybox/3.2.5/jquery.fancybox.min.js" async></script><script type="text/javascript" src="/js/fancybox.js?v=0.0.0" async></script><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/fancybox/3.2.5/jquery.fancybox.min.css"><script type="text/javascript" src="/js/search.js?v=0.0.0"></script><script>var search_path = 'search.xml';
if (search_path.length == 0) {
   search_path = 'search.xml';
}
var path = '/' + search_path;
searchFunc(path, 'local-search-input', 'local-search-result');
</script><script>var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = '//hm.baidu.com/hm.js?' + 'c16d3c10c9ea6c6fe749d9926d52b0d6';
  var s = document.getElementsByTagName("script")[0];
  s.parentNode.insertBefore(hm, s);
  })();
</script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div><script src="/live2dw/lib/L2Dwidget.min.js?094cbace49a39548bed64abff5988b05"></script><script>L2Dwidget.init({"log":false,"pluginJsPath":"lib/","pluginModelPath":"assets/","pluginRootPath":"live2dw/","tagMode":false});</script></body></html><div>
<a href="https://github.com/itgoyo"><img class="nofancybox" ;="" style="position: absolute; top: 0; right: 0; border: 0;" src="https://s3.amazonaws.com/github/ribbons/forkme_right_gray_6d6d6d.png" alt="Fork me on GitHub"></a>
</div>